[
    {
      "root": "scissor",
      "meanings": [
        {
          "sentence": "He scissored the shiny red ribbon neatly before wrapping the birthday present.",
          "trSentence": "Doğum günü paketini sarmadan önce parlak kırmızı kurdeleyi düzgünce makasla kesti.",
          "definition": "Cut something using scissors.",
          "partOfSpeech": "verb"
        },
        {
          "sentence": "The tailor's quick scissor left a perfectly straight edge along the fabric.",
          "trSentence": "Terzinin hızlı makas darbesi kumaş boyunca mükemmel düz bir kenar bıraktı.",
          "definition": "Single blade or cut made by scissors.",
          "partOfSpeech": "noun"
        }
      ],
      "wordFamilies": [
        {
          "word": "scissors",
          "partOfSpeech": "noun",
          "sentence": "She couldn't find her scissors, so she borrowed mine to cut the photos.",
          "trSentence": "Makasını bulamayınca fotoğrafları kesmek için benimkini ödünç aldı.",
          "definition": "A cutting tool with two crossed blades."
        },
        {
          "word": "scissored",
          "partOfSpeech": "verb",
          "sentence": "The artist scissored delicate snowflakes from thin white paper for the window display.",
          "trSentence": "Sanatçı, vitrin dekoru için ince beyaz kâğıttan zarif kar taneleri makasla kesti.",
          "definition": "Cut with scissors in the past."
        },
        {
          "word": "scissoring",
          "partOfSpeech": "noun",
          "sentence": "Continuous scissoring of the cloth produced soft fringes around the cushion edges.",
          "trSentence": "Kumaşın sürekli makasla kesilmesi yastık kenarlarında yumuşak püsküller oluşturdu.",
          "definition": "The act of cutting using scissors."
        },
        {
          "word": "scissorless",
          "partOfSpeech": "adjective",
          "sentence": "Facing scissorless packaging, he improvised by tearing the plastic with his keys.",
          "trSentence": "Makas gerektiren ambalajla karşılaşınca plastiği anahtarıyla yırtarak çözdü.",
          "definition": "Without any scissors available."
        },
        {
          "word": "scissory",
          "partOfSpeech": "adjective",
          "sentence": "The dancer's scissory leg movements impressed the judges during the contemporary routine.",
          "trSentence": "Dansçının makas tarzı bacak hareketleri modern rutinde jüriyi etkiledi.",
          "definition": "Resembling the motion of scissors."
        }
      ]
    }
]
